import React, { Component, Fragment } from 'react';
import { Tabs,Tab } from 'react-bootstrap';

class Productdetails extends Component {
    constructor(){
        super()
        this.state={
            key:"home"
        }
    }
    changeValue(){
        this.setState({key:'profile'})
    }
    render() {
        return (
            <Fragment>
                <section>
                    <div className="product_section2">
                        <h1>Product Specification and Summary</h1>
                        
                        <Tabs defaultActiveKey="home" id="uncontrolled-tab-example" className="mb-3">
                            <Tab eventKey="home" title="Summery">
                                <span>মিকি তাকিয়ে আছে তার বান্ধবী শি-এর দিকে। হঠাৎ অবিশ্বাস্য একটা ঘটনা ঘটল! শি-এর মুখের চামড়া ভেদ করে বেরিয়ে এলাে এক অজানা পােকা। তারপর ঢুকে গেল চোখের মধ্যে। শি কিছুই টের পায়নি। বিস্মিত মিকি বিষয়টা বলতে শি বিশ্বাস করল না। কিন্তু কিছুক্ষণ পর আবারও শরীরের মধ্য থেকে বের হয়ে এলাে পােকাটা। হাতের তালুতে রাখতে অবাক হয়ে দেখল পােকাটার অর্ধেক ধাতব আর অর্ধেক মাংসল। তাদেরকে অবাক করে দিয়ে পােকাঁটা শি-এর হাতের তালু ভেদ করে শরীরে প্রবেশ করল। তীব্র ব্যথায় চিৎকার করে উঠল শি৷ মিকি বাধ্য হলাে শিকে হাসপাতালে নিতে। শেষ পর্যন্ত অবশ্য বাঁচানাে গেল না শিকে। গবেষণায় প্রমাণিত হলাে ঐ পােকাটা ছিল নতুন এক বায়ােমেটালিক জীব, নাম ক্লিটি ভাইরাস। অজানা এক উপায়ে আক্রান্ত করছে পৃথিবীর মানুষকে। আক্রান্ত হওয়ার পর আর বাঁচার সম্ভাবনা থাকবে না মানুষের। ক্লিটি ভাইরাসকে নির্মূল করতে গবেষণা শুরু করে বিক এবং ইরিনা নামের দুই গবেষক। ইরিনা ভুলেও জানতে পারে না যে কখন সে নিজেই গবেষণা কার্যক্রমে গিনিপিগে পরিণত হয়েছে। যখন জানতে পারে, অনেক দেরি হয়ে গেছে। বন্দি করা হয়েছে তাকে। মৃত্যু। আসন্ন। শেষ পর্যন্ত কি ইরিনা পেরেছিল নিজেকে রক্ষা করতে? আর মানব সভ্যতা কি রক্ষা পেয়েছিল ক্লিটি ভাইরাসের আক্রমণ থেকে? </span>
                            </Tab>
                            <Tab eventKey="profile" title="Specification">
                                <table style={{width:"100%"}}>
                                    <tbody>
                                        <tr>
                                            <th style={{width:"20%",background:"#f1f2f4"}}>Title</th>
                                            <td>ক্লিটি ভাইরাস</td>
                                        </tr>
                                        <tr>
                                            <th style={{width:"20%",background:"#f1f2f4"}}>Author</th>
                                            <td>মোশতাক আহমেদ</td>
                                        </tr>
                                        <tr>
                                            <th style={{width:"20%",background:"#f1f2f4"}}>Publisher</th>
                                            <td>অনিন্দ্য প্রকাশ</td>
                                        </tr>
                                        <tr>
                                            <th style={{width:"20%",background:"#f1f2f4"}}>ISBN</th>
                                            <td>9789845263221</td>
                                        </tr>
                                        <tr>
                                            <th style={{width:"20%",background:"#f1f2f4"}}>Edition</th>
                                            <td>1st Published, 2020</td>
                                        </tr>
                                        <tr>
                                            <th style={{width:"20%",background:"#f1f2f4"}}>Number of Pages</th>
                                            <td>96</td>
                                        </tr>
                                        <tr>
                                            <th style={{width:"20%",background:"#f1f2f4"}}>Country</th>
                                            <td>বাংলাদেশ</td>
                                        </tr>
                                        <tr>
                                            <th style={{width:"20%",background:"#f1f2f4"}}>Language</th>
                                            <td>বাংলা</td>
                                        </tr>
                                    </tbody>
                                </table>
                            </Tab>
                            <Tab eventKey="contact" title="Author">
                                <span>লেখক মোশতাক আহমেদ এর জন্ম ১৯৭৫ সালের ৩০ ডিসেম্বর, ফরিদপুর জেলায়। পেশায় একজন অতিরিক্ত ডিআইজি হওয়া সত্ত্বেও লেখালেখির প্রতি তাঁর আগ্রহ প্রচুর। এ পর্যন্ত সায়েন্স ফিকশন নিয়েই সবচেয়ে বেশি লিখেছেন। বাংলা সায়েন্স ফিকশন জগতে তার পোক্ত একটি অবস্থান সৃষ্টি হয়েছে। এছাড়াও মোশতাক আহমেদ এর বই সমূহ ভৌতিক, প্যারাসাইকোলজি, মুক্তিযুদ্ধ, কিশোর ক্ল্যাসিক, ভ্রমণ ইত্যাদি জঁনরাতে বিভক্ত। যেকোনো একটি বিষয়ে সীমাবদ্ধ না থেকে তিনি বিভিন্ন বিষয় নিয়ে লিখতেই পছন্দ করেন। 
                                    মোশতাক আহমেদ এর বই সমগ্র সংখ্যায় পঞ্চাশ পেরিয়েছে। তাঁর প্রথম প্রকাশিত বই ছিল ‘জকি’। এটি একটি জীবনধর্মী উপন্যাস। ২০০৫ সালে এটি প্রকাশিত হয়।
                                    মোশতাক আহমেদ পড়াশোনা করেছেন ঢাকা বিশ্ববিদ্যালয়ে। প্রথমে ফার্মেসি বিভাগে, পরে আইবিএতে। পরবর্তী সময়ে ইংল্যান্ডের লেস্টার বিশ্ববিদ্যালয় থেকে অপরাধবিজ্ঞান থেকে মাস্টার্স ডিগ্রী অর্জন করেন। পড়াশোনার খাতিরেই হোক বা কর্মজীবনের তাগিদেই হোক, ব্যক্তিগত জীবনে তিনি অনেক ভ্রমণ করেছেন। সেসব ভ্রমণকাহিনীর আশ্রয়ে তাই ক্রমেই সমৃদ্ধ হয়েছে তাঁর লেখা ভ্রমণকাহিনীগুলোও।
                                    তাঁর সৃজনশীল কর্মকাণ্ড শুধু লেখালেখিতেই গণ্ডিবদ্ধ নয়। ১৯৭১ সালের ২৫শে মার্চ রাজারবাগের পুলিশ ও পাকিস্তানী হানাদারবাহিনীর মধ্যে একটি যুদ্ধ সংঘটিত হয়েছিল। সে ঘটনার ওপর ভিত্তি করে মোশতাক আহমেদ  ‘মুক্তিযুদ্ধের প্রথম প্রতিরোধ’ নামে একটি তথ্যচিত্র নির্মাণ করেন। এটি ২০১৩ সালের মার্চ মাসে মুক্তি পায়।
                                    তাঁর পুরস্কারের ঝুলিতে এ পর্যন্ত রয়েছে ২০১৩ সালের কালি ও কলম সাহিত্য পুরস্কার, ২০১৪ সালের ছোটদের মেলা সাহিত্য পুরস্কার, ২০১৪ সালের কৃষ্ণকলি সাহিত্য পুরস্কার, ২০১৫ সালের সিটি আনন্দ আলো পুরস্কার এবং সর্বশেষ সংযুক্তি হিসেবে সায়েন্স ফিকশন বিষয়ে বিশেষ অবদান রাখার জন্য বাংলা একাডেমি সাহিত্য পুরস্কার-২০১৭।
                                </span>
                            </Tab>
                        </Tabs>
                        <div className="report-section">
                            <i className="fas fa-exclamation-triangle"></i><a href="/">Report False Information</a>
                        </div>
                    </div>
                </section>
            </Fragment>
        );
    }
}

export default Productdetails;
